module.exports = () => {
    return [
        {
            title: "",
            collapsable: false,
            children: [
                'Java 高性能的异步网络IO传输.md',
                'Java高性能系统缓存的最佳实践.md',
                'Kafka实战(1)-为何大厂都在使用Kafka消息引擎系统.md',
                'Kafka实战(2)-Kafka消息模型核心概念.md',
                'Kafka实战(3)-Kafka的自我定位.md',
                'Kafka实战(4) -Kafka门派知多少.md',
                'Kafka实战(7)-优雅地部署 Kafka 集群.md',
                'Kafka架构解析1之背景及架构介绍.md',
                'kafka知识点&面试题总结.md',
                'Kafka高性能原理分析.md',
                '如何保证MQ不重复消费消息(幂等性).md',
                '消息积压&消息丢失解决方案.md',
                '消息队列实现复制的最佳实践.md',
                '消息队列面试解析系列(1)-消息队列的意义.md',
                '消息队列面试解析系列(2)- MQ选型.md',
                '消息队列面试解析系列（七）-数据压缩.md',
                '消息队列面试解析系列（三）-消息模型辨析.md',
                '消息队列面试解析系列（五）- 消息积压解决方案.md',
                '消息队列面试解析系列（六）- 异步编程妙用.md',
                '消息队列面试解析系列（四）- 消息可靠性投递的实现原理.md',
                '',
                '',
                '',
                '',
                ''
            ]
        }
    ]
}